In [2]:
import numpy as np
import pandas as pd

In [3]:
stud_df=pd.DataFrame( np.array(['ADB' , 44 , 90 , 'Smith' , 45 , 89 ,  'Watson' , 46 , 85 ,  'Ms Dhoni' , 47 , 100]).reshape(4 , 3) , columns = ['Name' , 'Roll no.' , 'Marks'])

In [5]:
stud_df

       Name Roll no. Marks
0       ADB       44    90
1     Smith       45    89
2    Watson       46    85
3  Ms Dhoni       47   100

In [6]:
year='FE SE TE BE'.split()

In [9]:
stud_df['year']= year

In [10]:
stud_df

       Name Roll no. Marks year
0       ADB       44    90   FE
1     Smith       45    89   SE
2    Watson       46    85   TE
3  Ms Dhoni       47   100   BE

In [13]:
stud_df.set_index('year'  , inplace=True)

In [14]:
stud_df

          Name Roll no. Marks
year
FE         ADB       44    90
SE       Smith       45    89
TE      Watson       46    85
BE    Ms Dhoni       47   100

In [4]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [5]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [6]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.955623  0.124615
   2  0.226562 -0.698297
   3  1.752047 -1.122866
G2 1 -2.949840  0.284580
   2 -1.497546  0.442220
   3  0.893930  0.535479

In [18]:
df.loc['G1']

          A         B
1 -0.169970 -0.600425
2 -0.588070 -1.836095
3  0.765567  0.033788

In [19]:
df.loc['G1'].loc[3]['A']

0.7655672077835458

In [20]:
df

             A         B
G1 1 -0.169970 -0.600425
   2 -0.588070 -1.836095
   3  0.765567  0.033788
G2 1 -0.231711  0.295667
   2 -1.600052  0.822620
   3 -0.074192 -0.693314

In [21]:
df.loc['G2'].loc[2]['A']

-1.6000523584006596

In [23]:
df.loc['G2']

          A         B
1 -0.231711  0.295667
2 -1.600052  0.822620
3 -0.074192 -0.693314

In [24]:
df.loc['G2'].loc[3]['B']

-0.6933137659793513

In [25]:
df

             A         B
G1 1 -0.169970 -0.600425
   2 -0.588070 -1.836095
   3  0.765567  0.033788
G2 1 -0.231711  0.295667
   2 -1.600052  0.822620
   3 -0.074192 -0.693314

In [11]:
df.index.names = ['Group','Num']

In [12]:
df.loc['G2']

            A         B
Num
1   -2.949840  0.284580
2   -1.497546  0.442220
3    0.893930  0.535479

In [13]:
df.loc['G2'].loc[3 , 'A']

0.8939299222031506

In [30]:
df.xs('G1')

          A         B
1 -0.169970 -0.600425
2 -0.588070 -1.836095
3  0.765567  0.033788

In [33]:
df

                  A         B
Group Num
G1    1   -0.169970 -0.600425
      2   -0.588070 -1.836095
      3    0.765567  0.033788
G2    1   -0.231711  0.295667
      2   -1.600052  0.822620
      3   -0.074192 -0.693314

In [35]:
df.xs(1 , level='Num')

              A         B
Group
G1    -0.169970 -0.600425
G2    -0.231711  0.295667

In [36]:
df

                  A         B
Group Num
G1    1   -0.169970 -0.600425
      2   -0.588070 -1.836095
      3    0.765567  0.033788
G2    1   -0.231711  0.295667
      2   -1.600052  0.822620
      3   -0.074192 -0.693314

In [37]:
df.xs(2 , level='Num')

              A         B
Group
G1    -0.588070 -1.836095
G2    -1.600052  0.822620

In [38]:
df.xs(3 , level='Num')

              A         B
Group
G1     0.765567  0.033788
G2    -0.074192 -0.693314

In [39]:
df.loc['G1'].loc[3 , 'B']

0.033788193230035166

In [7]:
df

             A         B
G1 1 -0.955623  0.124615
   2  0.226562 -0.698297
   3  1.752047 -1.122866
G2 1 -2.949840  0.284580
   2 -1.497546  0.442220
   3  0.893930  0.535479

In [8]:
df.loc['G1'].loc[3 , 'B']

-1.122865876694214

In [9]:
df.loc['G1']

          A         B
1 -0.955623  0.124615
2  0.226562 -0.698297
3  1.752047 -1.122866

In [10]:
df.loc['G1'].loc[2 ,'A']

0.22656216668338922

In [14]:
df

                  A         B
Group Num
G1    1   -0.955623  0.124615
      2    0.226562 -0.698297
      3    1.752047 -1.122866
G2    1   -2.949840  0.284580
      2   -1.497546  0.442220
      3    0.893930  0.535479

In [15]:
df.xs(3  , level='Num')

              A         B
Group
G1     1.752047 -1.122866
G2     0.893930  0.535479

In [17]:
df.xs(1 , level='Num')

              A         B
Group
G1    -0.955623  0.124615
G2    -2.949840  0.284580